old_kr = ['창', '출', '레', '민', '신', '수', '삿', '룻', '삼상', '삼하', '왕상', '왕하', '대상', '대하', '스', '느', '에', '욥', '시', '잠', '전', '아', '사', '렘', '애', '겔', '단', '호', '욜', '암', '옵', '욘', '미', '나', '합', '습', '학', '슥', '말']

new_kr = ['마', '막', '눅', '요', '행', '롬', '고전', '고후', '갈', '엡', '빌', '골', '살전', '살후', '딤전', '딤후', '딛', '몬', '히', '약', '벧전', '벧후', '요일', '요이', '요삼', '유', '계']

BOOKS_KR = [''] + old_kr + new_kr

old_jp = ['創', '出', 'レビ', '民', '申', 'ヨシュ', '士', 'ルツ', 'サム上', 'サム下', '王上', '王下', '代上', '代下', 'エズ', 'ネヘ', 'エス', 'ヨブ', '詩', '箴', 'コヘ', '雅', 'イザ', 'エレ', '哀', 'エゼ', 'ダニ', 'ホセ', 'ヨエ', 'アモ', 'オバ', 'ヨナ', 'ミカ', 'ナホ', 'ハバ', 'ゼファ', 'ハガ', 'ゼカ', 'マラ']

new_jp = ['マタイ', 'マルコ', 'ルカ', 'ヨハネ', '使徒', 'ロマ', '一コリ', '二コリ', 'ガラ', 'エぺ', 'フィリ', 'コロ', '一テサ', '二テサ', '一テモ', '二テモ', 'テト', 'フィレ', 'ヘブ', 'ヤコ', '一ペト', '二ペト', '一ヨハ', '二ヨハ', '三ヨハ', 'ユダ', '黙']

BOOKS_JP = [''] + old_jp + new_jp

BOOK_CHAPTERS = ['', 50, 40, 27, 36, 34, 24, 21, 4, 31, 24, 22, 25, 29, 36, 10, 13, 10, 42, 150, 31, 12, 8, 66, 52, 5, 48, 12, 14, 3, 9, 1, 4, 7, 3, 3, 3, 2, 14, 4, 28, 16, 24, 21, 28, 16, 16, 13, 6, 6, 4, 4, 5, 3, 6, 4, 3, 1, 13, 5, 5, 3, 5, 1, 1, 1, 22]

if __name__ == "__main__":
    book = 66
    print(len(BOOK_CHAPTERS))
    # print(BOOKS_KR[book])
    # print(BOOKS_JP[book])
