# flake8: noqa
# fmt: off

old_kr = ['창', '출', '레', '민', '신', '수', '삿', '룻', '삼상', '삼하', '왕상', '왕하', '대상', '대하', '스', '느', '에', '욥', '시', '잠', '전', '아', '사', '렘', '애', '겔', '단', '호', '욜', '암', '옵', '욘', '미', '나', '합', '습', '학', '슥', '말']

new_kr = ['마', '막', '눅', '요', '행', '롬', '고전', '고후', '갈', '엡', '빌', '골', '살전', '살후', '딤전', '딤후', '딛', '몬', '히', '약', '벧전', '벧후', '요일', '요이', '요삼', '유', '계']

BOOKS_KR = [''] + old_kr + new_kr

BOOKS_KR_FULL = ['창세기', '출애굽기', '레위기', '민수기', '신명기', '여호수아', '사사기', '룻기', '사무엘상', '사무엘하', '열왕기상', '열왕기하', '역대상', '역대하', '에스라', '느헤미야', '에스더', '욥기', '시편', '잠언', '전도서', '아가', '이사야', '예레미야', '예레미야애가', '에스겔', '다니엘', '호세아', '요엘', '아모스', '오바댜', '요나', '미가', '나훔', '하박국', '스바냐', '학개', '스가랴', '말라기', '마태복음', '마가복음', '누가복음', '요한복음', '사도행전', '로마서', '고린도전서', '고린도후서', '갈라디아서', '에베소서', '빌립보서', '골로새서', '데살로니가전서', '데살로니가후서', '디모데전서', '디모데후서', '디도서', '빌레몬서', '히브리서', '야고보서', '베드로전서', '베드로후서', '요한일서', '요한이서', '요한삼서', '유다서', '요한계시록']

old_jp = ['創', '出', 'レビ', '民', '申', 'ヨシ', '士', 'ルツ', 'Iサム', 'IIサム', 'I列', 'II列', 'I歴', 'II歴', 'エズ', 'ネヘ', 'エス', 'ヨブ', '詩', '箴', '伝', '雅', 'イザ', 'エレ', '哀', 'エゼ', 'ダニ', 'ホセ', 'ヨエ', 'アモ', 'オバ', 'ヨナ', 'ミカ', 'ナホ', 'ハバ', 'ゼパ', 'ハガ', 'ゼカ', 'マラ']

new_jp = ['マタ', 'マル', 'ルカ', 'ヨハ', '使', 'ロマ', 'Iコリ', 'IIコリ', 'ガラ', 'エぺ', 'ピリ', 'コロ', 'Iテサ', 'IIテサ', 'Iテモ', 'IIテモ', 'テト', 'ピレ', 'ヘブ', 'ヤコ', 'Iペト', 'IIペト', 'Iヨハ', 'IIヨハ', 'IIIヨハ', 'ユダ', '黙']

BOOKS_JP = [''] + old_jp + new_jp

BOOK_CHAPTERS = ['', 50, 40, 27, 36, 34, 24, 21, 4, 31, 24, 22, 25, 29, 36, 10, 13, 10, 42, 150, 31, 12, 8, 66, 52, 5, 48, 12, 14, 3, 9, 1, 4, 7, 3, 3, 3, 2, 14, 4, 28, 16, 24, 21, 28, 16, 16, 13, 6, 6, 4, 4, 5, 3, 6, 4, 3, 1, 13, 5, 5, 3, 5, 1, 1, 1, 22]

# fmt: on
if __name__ == "__main__":
    # book = 66
    # print(len(BOOK_CHAPTERS))
    # print(BOOKS_KR[book])
    # print(BOOKS_JP[book])
    print(BOOKS_JP.index("ヨハ"))
